Projects/Join_Typ/output/logs/varchar_queries/varchar_queries_insert_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 8 tps: 0.00 qps: 31403.18 (r/w/o: 0.00/3947.78/27455.40) lat (ms,95%): 0.00 err/s: 6.66 reconn/s: 0.00
[ 6s ] thds: 8 tps: 2.67 qps: 32176.86 (r/w/o: 0.00/4048.43/28128.44) lat (ms,95%): 0.00 err/s: 8.34 reconn/s: 0.00
[ 9s ] thds: 8 tps: 0.00 qps: 35017.33 (r/w/o: 0.00/4377.17/30640.16) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 2.67 qps: 31801.75 (r/w/o: 0.00/4007.64/27794.11) lat (ms,95%): 0.00 err/s: 11.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 0.00 qps: 34874.94 (r/w/o: 0.00/4359.37/30515.57) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 2.67 qps: 31817.93 (r/w/o: 0.00/4010.03/27807.91) lat (ms,95%): 0.00 err/s: 9.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 0.00 qps: 34856.73 (r/w/o: 0.00/4357.09/30499.64) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           88428
        other:                           616262
        total:                           704690
    transactions:                        32     (1.51 per sec.)
    queries:                             704690 (33156.07 per sec.)
    ignored errors:                      105    (4.94 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.2536s
    total number of events:              32

Latency (ms):
         min:                                 5291.81
         avg:                                 5313.03
         max:                                 5339.80
         95th percentile:                        0.00
         sum:                               170016.88

Threads fairness:
    events (avg/stddev):           4.0000/0.00
    execution time (avg/stddev):   21.2521/0.00