Projects/Join_Typ/output/logs/varchar_queries/varchar_queries_insert_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 8 tps: 0.00 qps: 32403.46 (r/w/o: 0.00/4115.96/28287.50) lat (ms,95%): 0.00 err/s: 9.33 reconn/s: 0.00
[ 6s ] thds: 8 tps: 2.66 qps: 32718.61 (r/w/o: 0.00/4123.48/28595.13) lat (ms,95%): 0.00 err/s: 6.32 reconn/s: 0.00
[ 9s ] thds: 8 tps: 0.00 qps: 34856.88 (r/w/o: 0.00/4356.86/30500.02) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 2.67 qps: 32818.81 (r/w/o: 0.00/4129.43/28689.37) lat (ms,95%): 0.00 err/s: 9.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 0.00 qps: 34139.49 (r/w/o: 0.00/4267.44/29872.06) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 2.67 qps: 32473.21 (r/w/o: 0.00/4091.57/28381.64) lat (ms,95%): 0.00 err/s: 8.33 reconn/s: 0.00
[ 21s ] thds: 8 tps: 0.00 qps: 35103.08 (r/w/o: 0.00/4387.89/30715.20) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           88770
        other:                           617586
        total:                           706356
    transactions:                        32     (1.52 per sec.)
    queries:                             706356 (33502.98 per sec.)
    ignored errors:                      99     (4.70 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.0832s
    total number of events:              32

Latency (ms):
         min:                                 5225.95
         avg:                                 5270.44
         max:                                 5322.75
         95th percentile:                        0.00
         sum:                               168654.04

Threads fairness:
    events (avg/stddev):           4.0000/0.00
    execution time (avg/stddev):   21.0818/0.00