Projects/Join_Typ/output/logs/varchar_queries/varchar_queries_select_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 8 tps: 415.90 qps: 415.90 (r/w/o: 415.90/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 424.31 qps: 424.31 (r/w/o: 424.31/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 423.57 qps: 423.57 (r/w/o: 423.57/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 423.30 qps: 423.30 (r/w/o: 423.30/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 423.59 qps: 423.59 (r/w/o: 423.59/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 424.46 qps: 424.46 (r/w/o: 424.46/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 423.12 qps: 423.12 (r/w/o: 423.12/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8883
        write:                           0
        other:                           0
        total:                           8883
    transactions:                        8883   (422.63 per sec.)
    queries:                             8883   (422.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.0183s
    total number of events:              8883

Latency (ms):
         min:                                   15.47
         avg:                                   18.92
         max:                                   59.66
         95th percentile:                        0.00
         sum:                               168065.11

Threads fairness:
    events (avg/stddev):           1110.3750/5.61
    execution time (avg/stddev):   21.0081/0.00